#pragma once
//=============================================================================
// SamplerState.h
//=============================================================================
// Author  èºñÏ è´îV
//=============================================================================

#include <main.h>

//=============================================================================
// 
// ÉNÉâÉXíËã`
// 
//=============================================================================
class SamplerState
{
public:
	SamplerState();
	~SamplerState();

	HRESULT Create(D3D11_FILTER filter, D3D11_TEXTURE_ADDRESS_MODE address);
	void Bind();

private:
	ID3D11SamplerState* m_pState;
};

