//=============================================================================
// SamplerState.cpp
//=============================================================================
// Author  松野 将之
//=============================================================================

#include "SamplerState.h"
#include "Graphics.h"

//=============================================================================
// 
// コンストラクタ
// 
//=============================================================================
SamplerState::SamplerState()
{
	m_pState = nullptr;
}

//=============================================================================
// 
// デストラクタ
// 
//=============================================================================
SamplerState::~SamplerState()
{
	SAFE_RELEASE(m_pState);
}

//=============================================================================
// 
//	生成
// 
//=============================================================================
HRESULT SamplerState::Create(D3D11_FILTER filter, D3D11_TEXTURE_ADDRESS_MODE address)
{
	D3D11_SAMPLER_DESC desc = {};
	desc.Filter = filter;
	desc.AddressU = address;
	desc.AddressV = address;
	desc.AddressW = address;
	return GetDevice()->CreateSamplerState(&desc, &m_pState);
}

//=============================================================================
// 
// シェーダセット
// 
//=============================================================================
void SamplerState::Bind()
{
	GetDeviceContext()->PSSetSamplers(0, 1, &m_pState);
	Singleton<Graphics>::GetInstance().SetSamplerState(this);
}