//=============================================================================
// SamplerState.h
//=============================================================================
// Author  èºñÏ è´îV
//=============================================================================
#pragma once

#include <main.h>

//=============================================================================
// 
// ÉNÉâÉXíËã`
// 
//=============================================================================
class CSamplerState
{
public:
	CSamplerState();
	~CSamplerState();

	HRESULT Create(D3D11_FILTER filter, D3D11_TEXTURE_ADDRESS_MODE address);
	void Bind();

private:
	ID3D11SamplerState* m_pState;
};

