//=============================================================================
// GameOverBackGround.cpp
//=============================================================================
// Author  松野 将之
//=============================================================================
#include "GameOverBackGround.h"

//=============================================================================
// 
// 無名名前空間
// 
//=============================================================================
namespace
{
	const auto GameOverBackGround = L"data/texture/GameOver/GameOverBg.png";
	const float AlphaAdd = 0.01f; // α加算値
}

//=============================================================================
// 
// コンストラクタ
// 
//=============================================================================
CGameOverBackGround::CGameOverBackGround()
{
	m_fAlpha = 0.0f;
}

//=============================================================================
// 
// 初期化処理
// 
//=============================================================================
void CGameOverBackGround::Init()
{
	// ゲームオーバー背景初期化
	m_Polygon->SetSize(SCREEN_WIDTH, SCREEN_HEIGHT);
	m_Polygon->LoadTexture(GameOverBackGround);
	m_Polygon->SetAlpha(0);
}

//=============================================================================
// 
// 終了処理
// 
//=============================================================================
void CGameOverBackGround::Uninit()
{
}

//=============================================================================
// 
// 更新処理
// 
//=============================================================================
void CGameOverBackGround::Update()
{
	// 背景色更新(赤色の点滅処理)
	static bool bDisp = false;
	if (!bDisp) m_fAlpha += AlphaAdd;
	if (m_fAlpha >= 0.7f) bDisp = true;
	if (bDisp) m_fAlpha -= AlphaAdd;
	if (m_fAlpha <= 0.0f) bDisp = false;

	// 背景色変更
	m_Polygon->SetAlpha(m_fAlpha);
}

//=============================================================================
// 
// 描画処理
// 
//=============================================================================
void CGameOverBackGround::Draw()
{
	m_Polygon->Draw();
}