//=============================================================================
// Caterpillar.h
//=============================================================================
// Author  松野 将之
//=============================================================================
#pragma once

#include <Manager/Object.h>

//=============================================================================
// 
// マクロ定義
// 
//=============================================================================
// タグ名
const std::string TagCaterpillar = "Caterpillar";

// キャタピラアニメ
enum class CaterpillarAnime
{
	eMove = 0,
	eNone,
	eCaterpillarAnimeMax
};

//=============================================================================
// 
// クラス定義
// 
//=============================================================================
class CCaterpillar : public CObject
{
public:
	CCaterpillar();
	~CCaterpillar() = default;

	void Init()	  override;
	void Update() override;
};