//=============================================================================
// CCube.h
//=============================================================================
// Author  松野 将之
//=============================================================================
#pragma once

#include <Manager/Object.h>

//=============================================================================
// 
// マクロ定義
// 
//=============================================================================
// モデル
#define MODEL_CUBE "data/MODEL/Object/Magnet/Magnet1.fbx"
// タグ名
const std::string TagCube = "Cube";

//=============================================================================
// 
// クラス定義
// 
//=============================================================================
class CCube : public CObject
{
public:
	CCube();
	~CCube() = default;

	void Init()	  override;
	void Update() override;

private:
	//// 通電時のテクスチャ
	//std::string m_energyOnTexture;
	//// 非通電時のテクスチャ
	//std::string m_energyOffTexture;
};