//=============================================================================
// Gear.cpp
//=============================================================================
// Author  松野 将之
//=============================================================================
#include "Generare.h"
#include <Manager/ObjectManager.h>

#define MODEL_GENERARE	"data/model/Object/MainAnim_Blender/Generare_Anim_Blender.fbx"

//=============================================================================
// 
// コンストラクタ
// 
//=============================================================================
CGenerare::CGenerare()
{
	m_tag = "Generare";
	m_Model.LoadModel(MODEL_GENERARE);
}

//=============================================================================
// 
// 初期化処理
// 
//=============================================================================
void CGenerare::Init()
{
}

//=============================================================================
// 
// 更新処理
// 
//=============================================================================
void CGenerare::Update()
{
	// プレイヤーの座標と同じ場所に
	const auto& player = ObjectManager::SearchObjectTag("Player");
	m_Pos = player.lock()->GetPos();
	m_Scale = player.lock()->GetScale();
	m_Rot = player.lock()->GetRot();
}
