//=============================================================================
// CGimic.h
//=============================================================================
// Author  èºñÏ è´îV
//=============================================================================
#pragma once

#include <Manager/Object.h>

#define MODEL_GIMIC "data/MODEL/Object/DamageTrap/DamageTrap1.fbx"

//=============================================================================
// 
// ÉNÉâÉXíËã`
// 
//=============================================================================
class CGimic : public Object
{
public:
	CGimic();
	~CGimic() = default;

	void Init()	  override;
	void Update() override;
};
