//=============================================================================
// meshfield.h
//=============================================================================
// Author  松野 将之
//=============================================================================
#pragma once

#include <Manager/Object.h>
#include <Renderer/Mesh/mesh.h>
//=============================================================================
// 
// マクロ定義
// 
//=============================================================================
// タグ名
const std::string TagStageGround = "StageGround";

//=============================================================================
// 
// クラス定義
// 
//=============================================================================
class CStageGround : public CObject
{
public:

	CStageGround();
	~CStageGround() = default;

	void Init()   override;
	void Uninit() override;
	void Update() override;
	void Draw()   override;

private:
	// ステージ表示用メッシュ
	CMesh m_MeshField;
};

