#pragma once
//=============================================================================
// Trap.h
//=============================================================================
// Author  èºñÏ è´îV
//=============================================================================
#pragma once

#include <Manager/Object.h>

#define MODEL_TRAP	 "data/MODEL/Object/Lift/Lift1.fbx"

//=============================================================================
// 
// ÉNÉâÉXíËã`
// 
//=============================================================================
class CTrap : public Object
{
public:
	CTrap();
	~CTrap() = default;

	void Init()	  override;
	void Update() override;

private:
	int m_nCount;
};