#pragma once
//=============================================================================
// Trap.h
//=============================================================================
// Author  松野 将之
//=============================================================================
#pragma once

#include <Manager/Object.h>

#define MODEL_TRAP	 "data/MODEL/Object/Lift/Lift1.fbx"

//=============================================================================
// 
// クラス定義
// 
//=============================================================================
class CTrap : public Object
{
public:
	CTrap();
	~CTrap() = default;

	void Init()	  override;
	void Update() override;

private:
	int m_nCount; // エフェクト発生用カウント
};