//=============================================================================
// CWall.h
//=============================================================================
// Author  èºñÏ è´îV
//=============================================================================
#pragma once

#include <Manager/Object.h>

#define MODEL_WALL	 "data/MODEL/Object/BreakBrock/BreakBrock1.fbx"

//=============================================================================
// 
// ÉNÉâÉXíËã`
// 
//=============================================================================
class CWall : public Object
{
public:
	CWall();
	~CWall() = default;

	void Init()	  override;
	void Update() override;
};