//=============================================================================
// Number.cpp
//=============================================================================
// Author  松野 将之
//=============================================================================
#include "DrawNumber.h"
#include <System/Message/Message.h>

//=============================================================================
// 
// 無名名前空間
// 
//=============================================================================
namespace
{
	constexpr auto NumberFrameX = 10; // 横フレーム数
	constexpr auto NumberFrameY = 1;  // 縦フレーム数
}

//=============================================================================
// 
// コンストラクタ
// 
//=============================================================================
CNumber::CNumber()
{
	m_nNumber = 0;
	m_Pos = XMFLOAT2();
}

//=============================================================================
// 
// 初期化処理
// 
//=============================================================================
void CNumber::Init(const wchar_t* FileName)
{
	m_Polygon.SetSize(80.0f, 110.0f);
	m_Polygon.SetFrameSize(1.0f / NumberFrameX, 1.0f / NumberFrameY);	// UVを10分割
	m_Polygon.LoadTexture(FileName);
}

//=============================================================================
// 
// 終了処理
// 
//=============================================================================
void CNumber::Uninit()
{
}

//=============================================================================
// 
// 更新処理
// 
//=============================================================================
void CNumber::Update()
{
}

//=============================================================================
// 
// 描画処理
// 
//=============================================================================
void CNumber::Draw(int Number, XMFLOAT2 pos)
{
	int nNumber = m_nNumber = Number;
	m_Pos = pos;
	for (int i = 0; i <= nNumber; ++i)
	{
		m_Polygon.SetPosition(m_Pos.x, m_Pos.y);

		// 一桁になったら中央に
		if (m_nNumber < 10)
		{
			m_Pos.x -= 40.0f;
			m_Polygon.SetPosition(m_Pos.x, m_Pos.y);
		}
		// UV座標をセット
		unsigned n = nNumber % NumberFrameX;
		nNumber /= NumberFrameX;
		int u = n % NumberFrameX;
		int v = n / NumberFrameX;
		m_Polygon.SetUV(u / (float)NumberFrameX, v / (float)NumberFrameY);

		// 桁数の位置をずらす
		m_Pos.x -= 80.0f;
		m_Polygon.Draw();
	}
}