//=============================================================================
// EditScene.cpp
//=============================================================================
// Author  松野 将之
//=============================================================================
#include "EditScene.h"
#include <System/Camera/Camera.h>
#include <Manager/ObjectManager.h>
#include <System/Sound/Sound.h>

//=============================================================================
// 
// コンストラクタ
// 
//=============================================================================
CEditScene::CEditScene()
{
	CSingleton<CSceneManager>::GetInstance().SetSceneNo(eSceneEdit);
}

//=============================================================================
// 
// 初期化処理
// 
//=============================================================================
void CEditScene::Init()
{
	// カメラ
	CSingleton<CCamera>::GetInstance().Init();
	// 地面初期化
	m_Field.Init();
	// エディット初期化
	m_Editor.Init();
}

//=============================================================================
// 
// 終了処理
// 
//=============================================================================
void CEditScene::Uninit()
{
	// オブジェクト終了
	CObjectManager::UninitAll();
	// 地面終了
	m_Field.Uninit();
	// エディット終了
	m_Editor.Uninit();
	// サウンド終了
	CSound::Stop(EDIT);
}

//=============================================================================
// 
// 更新処理
// 
//=============================================================================
void CEditScene::Update()
{
	// EditBGM
	CSound::Play(EDIT);
	// 地面更新
	m_Field.Update();
	// エディット更新
	m_Editor.Update();
}

//=============================================================================
// 
// 描画処理
// 
//=============================================================================
void CEditScene::Draw()
{
	// 地面描画
	m_Field.Draw();
	// オブジェクト描画
	CObjectManager::DrawAll();
	// エディット描画
	m_Editor.Draw();
}