//=============================================================================
// ModeSelect.h
//=============================================================================
// Author  松野 将之
//=============================================================================
#pragma once

#include <Renderer/Polygon/CPolygon.h>

//=============================================================================
// 
// クラス定義
// 
//=============================================================================
class CModeSelect
{
public:
	CModeSelect();
	~CModeSelect() = default;

	void Init();
	void Uninit();
	void Update(int& index, int ModeNum);
	void Draw();

private:
	CPolygon m_Polygon;		// カーソル
};