//=============================================================================
// Fade.cpp
//=============================================================================
// Author  松野 将之
//=============================================================================
#include "fade.h"
#include <System/Sound/Sound.h>

//=============================================================================
// 
// 無名名前空間
// 
//=============================================================================
namespace
{
	const float FadeRate = 0.02f; // フェード時間
}

//=============================================================================
// 
// コンストラクタ
// 
//=============================================================================
CFade::CFade()
{
	m_fAlpha = 0.0f;
	m_nFade = eFadeIn;
	m_pNextScene = nullptr;
}

//=============================================================================
// 
// 初期化処理
// 
//=============================================================================
void CFade::Init()
{
	m_FadePolygon.SetSize(SCREEN_WIDTH, SCREEN_HEIGHT);
	m_FadePolygon.SetTex(nullptr);
	m_FadePolygon.SetColor(0.0f,0.0f,0.0f);	// 画面を黒色に

	m_FadeTexture.Init();
}

//=============================================================================
// 
// 終了処理
// 
//=============================================================================
void CFade::Uninit()
{
	m_FadeTexture.Uninit();
}

//=============================================================================
// 
// 更新処理
// 
//=============================================================================
void CFade::Update()
{
	// 次のシーンが設定されていなければスキップ
	if (m_nFade == eFadeNone)	return;
	//if (!m_pNextScene)	return;

	m_FadePolygon.SetAlpha(m_fAlpha);
	m_FadeTexture.Fade(m_fAlpha);

	// フェードイン処理
	if (m_nFade == eFadeOut) 
	{
		// 徐々にフェード
		m_fAlpha += FadeRate;
		if (m_fAlpha >= 1.0f) 
		{
			// フェードイン処理に切替
			m_fAlpha = 1.0f;
			m_nFade = eFadeIn;

			// シーン切替
			CSceneManager::GetInstance().EndFade(m_pNextScene);
		}
		CSound::SetVolume(1.0f - m_fAlpha);
		return;
	}

	// フェードアウト処理
	m_fAlpha -= FadeRate;

	if (m_fAlpha <= 0.0f) 
	{
		// フェード処理終了
		m_fAlpha = 0.0f;
		EndFade();
		m_nFade = eFadeNone;
	}
	CSound::SetVolume(1.0f - m_fAlpha);
}

//=============================================================================
// 
// 描画処理
// 
//=============================================================================
void CFade::Draw()
{
	m_FadePolygon.Draw();
	m_FadeTexture.Draw();
}

//=============================================================================
// 
// フェードアウト開始
// 
//=============================================================================
void CFade::SetFadeOut(CScene* sceneNext)
{
	if (m_nFade != eFadeOut)
	{
		m_nFade = eFadeOut;
		m_pNextScene = sceneNext;
	}
}

//=============================================================================
// 
// フェードアウト開始
// 
//=============================================================================
void CFade::EndFade()
{
	m_pNextScene = nullptr;

}